pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
#include "tft.h"
#include "hmi_user_uart.h"
#include "stdio.h"
#include "hmi_driver.h"
#include "flash.h"
#include "ulitity.h"
#include "cJSON.h"
#include "stdlib.h"
#include "stm32f10x_tim.h"
#include "timer.h"
#include "cmd_queue.h"
#include "malloc.h"
#include "string.h"
#include "24c02.h"

extern uint8 Light_mark_button; 
extern uint8 last_time_light_mark_button; //记录上次触发标记值
extern uint8 TIME3_Counter;                //定时器3溢出计数
uint8 TIM3_EN_Mark=1;                        //定时器3使能标志位


Speed_Control Speed;
Pram_Status pram_status;
Control_Panel_Pram control_panel_pram;
Return_Workpiece_Zero return_workpiece_zero;
Devide_Set devide_set;  

uint8  cmd_buffer[CMD_MAX_SIZE];                     //LCD指令缓存
uint8  Multiple_num;
char  Working_line_buf[20];                      //保存加工行数
uint16 Pulses_counter;                           // 手轮脉冲数量
uint16 last_Pulses_Counter;
uint8 Puless_Changed_Mark=0;                     //脉冲变化标记位，0；无变化，1：有变化

uint8 Coordinate_Change_Counter=0;                      //坐标切换按钮触发计数
uint8 Multiple_Change_Counter=1;                        //倍率切换按钮触发计数
uint8 Pulses_count_mark=1;                              //脉冲计数使能标记位
uint8 file_name[20]="精雕佛像";    //文件名

uint8  Work_Page_Status = 0;             //工作页面标记
uint8  get_cmd_type;                     //获取指令类型
uint8  get_ctrl_msg;                     //获取消息的类型
uint8  get_button_state;                 //获取按钮状态
uint8  get_control_type;                 //获取控件类型
uint16 get_screen_id;                    //获取画面ID
uint16 get_control_id;                   //获取控件ID
uint32 get_value;                        //获取数值
uint8  input_buf[20];                    //键盘输入内容

uint8  Press_button=0XFF;          //记录哪个按钮触发(需要把按键发送给雕刻机),0XFF：表示无效按键
uint8 last_time_work_state=0;      //记录上一次机器工作状态,默认是关机状态
int32 Working_line;                //加工行数
uint8 first_time_re_workpiece;     //首次进入回工件零页面


uint8 Cloud_File_Button=0;        //云空间文件选中按钮
uint8 SD_File_Button=0;           //SD卡文件选中按钮
uint8 Download_Per=0;             //已经下载百分比
uint8 Start_Download=0;           //开始下载标志位，0：没下载，1：正在下载
uint8 Cloud_Page=1;               //云空间页面
uint8 Last_time_Cloud_Page=0;
uint8 SD_Page=1;                  //SD卡页面
uint8 Last_time_SD_Page=0;
uint8 WiFi_Page=1;
uint8 Last_time_WiFi_Page=0;


uint8 Network_Control=4;   //0:无效，1：显示连接网络控件，2：隐藏连接网络控件，3：显示断开连接控件，4：隐藏断开连接控件
uint8 Sign_Control=4;      //0:无效，1：显示立即登录控件，2：隐藏立即登录控件，3：显示退出登录控件，4：隐藏退出登录控件
uint8 WiFi_Password_Right=0;  //网络密码正确
uint8 Account_Password_Right=0;//账户密码正确

State state;                               //申明工作状态结构体变量
Speed_Control Speed;                       //声明主轴速度相关的结构体变量
Pram_Status pram_status;                   //声明设置页面相关参数的结构体变量
Control_Panel_Pram control_panel_pram;      //声明控制面板相关参数的结构体变量
Return_Workpiece_Zero return_workpiece_zero;//声明回工件零相关参数的结构体变量
Devide_Set devide_set;                     //声明分中设置相关参数的结构体变量
Jump_Work_Set jump_work_set;               //声明跳行加工相关参数的结构体变量



//计算脉冲数量
void Get_Pulses_num(void)
{	
	uint16 temp_count;
	temp_count=TIM_GetCounter(TIM4);
	if(temp_count%4==0)
	{
  	Pulses_counter= temp_count;
	}
	else
	{
	  Pulses_counter=temp_count+(4-temp_count%4);
	}
}

//计算手轮脉冲个数
void Pulses_Count_Process(void)
{
  if( Work_Page_Status == Working_Page || Work_Page_Status == ControlPanel_Page )  //当处于加工页面或者控制面板页面时，手轮脉冲计数开始
	{
		if(Pulses_count_mark)       //脉冲计数使能标记位置1
		{
		  TIM_Cmd(TIM4, ENABLE);    //开启定时器4，开始脉冲计数
			Pulses_count_mark=0;
		}
		Get_Pulses_num();          //计算脉冲数量
		
		sprintf(Working_line_buf,"%u",Pulses_counter);  
		SetTextValue(0,22,(uchar *)Working_line_buf);     //显示脉冲个数 
	}
	else
	{
		if(Pulses_count_mark==0)
		{
	    TIM_Cmd(TIM4, DISABLE);          //禁止 TIM4，脉冲不计数	
      Pulses_count_mark=1;			
		}
		
	}	
}


//屏幕背光亮度控制
void light_Control_Process(void)
{
	
	
	//判断脉冲是否发生变化
	if(last_Pulses_Counter != Pulses_counter)
	{
		last_Pulses_Counter = Pulses_counter;
	  Puless_Changed_Mark = 1;
	}
	else  
		Puless_Changed_Mark =  0;	
	
	//Light_mark_button:每次屏幕有按键触发时，自动加1
	if(Light_mark_button != last_time_light_mark_button || Puless_Changed_Mark)  //有按键触发或者手轮转动
	{
		SetLightLevel(50);
		last_time_light_mark_button=Light_mark_button;
		TIME3_Counter=0;           //定时器3溢出次数清零
		TIM3_EN_Mark=1;            //使能定时器3
		if(Light_mark_button==100)  //清零
		{
		  last_time_light_mark_button=0;
			Light_mark_button=0;
		}
	}
	else      //无动作发生，使能定时器3，倒计时
	{
		if(TIM3_EN_Mark)
		{
		  TIM_Cmd(TIM3, ENABLE);	
			TIM3_EN_Mark=0;
		}			
	}
		
	if(TIME3_Counter==4)  //定时30s,没有动作发生，则降低屏幕亮度
	{
		TIME3_Counter=0;
	  SetLightLevel(200);
		TIM_Cmd(TIM3, DISABLE);
	}




}

/************************************************************
*
*程序进入标记的工作页面，处理相关任务
*参数：Work_Page_Status ：手轮当前所在的工作页面
*
*************************************************************/
void TFT_Page_handle(void)
{
	switch(Work_Page_Status)
	{	
		case Working_Page: //*********************************************************加工页面***************************************************************************************************
		{	
			                           
			Spindle_and_Work_Speed_Key_Process();	           	//加工中心主轴速度和加工速度按钮处理
	
			//SetTextValue(0,21,(uchar *)file_name);          //显示正在加载的文件名	

//			sprintf(Working_line_buf,"%d",Pulses_counter);  
//			SetTextValue(0,22,(uchar *)Working_line_buf);     //显示加工行数，需要向主机询问
			
		}break;
		case Setting_page:  //********************************************************设置页面*************************************************************************************************
		{
		 if(pram_status.Setting_Page_cancel_button)          //取消按钮按下
		 {
				Return_last_status();                           //恢复上一次设置状态 
				pram_status.Setting_Page_cancel_button=0;
				Work_Page_Status=Working_Page;				 
		 }		
		}break;
//		case Save_Pram_Page:  //****************************************************提示是否保存参数设置****************************************************************************************
//		{
//			if(state.Work_state==Stop)                                   //停止加工
//			{
//				if(pram_status.Save_Pram_Page_Sure_button)                   //“确定按钮”按下
//				{
//					Save_Set();                                              //保存设置
//					Work_Page_Status=Working_Page;
//				}
//				if(pram_status.Save_Pram_Page_concel_button)                 //取消按钮按下
//				{
//					Return_last_status();                                    //恢复上一次设置状态
//					Work_Page_Status=Working_Page;					
//				}	
//			}				
//		} break;	
		case ControlPanel_Page:  //******************************************************控制面板页面*****************************************************************************************
		{	
			//Get_Pulses_num();                                   //计算脉冲个数 
			
			//SetTextValue(2,27,(uchar *)file_name);            //显示正在加载的文件名	         				
			//sprintf(Working_line_buf,"%d",Pulses_counter);  
			//SetTextValue(2,28,(uchar *)Working_line_buf);     //显示加工行数，需要向主机询问	
			
		}break;
		case Return_WorkPiece_Zero_Page:   //*******************************************回工件零页面***************************************************************************************
		{ 
			
