pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
		}
			break;
		case File_Manage_Page:    //*****************************************************文件管理页面****************************************************************************************
		{
		  char buf[20];
		  if(Press_button==CMD_Download)   //下载按钮触发
			{
				Start_Download=1;               //下载标志位置1
				SetButtonValue(6,1,1);    //设值按钮为下载状态
			  SetControState(6,1,0);		 //禁止控件	
				Press_button=0xFF;
			}		
			if(Start_Download)
			{
			   sprintf(buf,"已下载%d%%",Download_Per);
				 SetTextValue(6,38,(uchar *)buf);     //显示下载百分比
				 if(Download_Per==100)
				 {
					 Download_Per=0;
					 Start_Download=0;
					 ClearTextValue(6,38);     //清除文本
					 SetControState(6,1,1);		 //使能控件	
					 SetButtonValue(6,1,0);    //设置值按钮位初始状态
				 }
			}
			if(Press_button==CMD_Cancel_Download)  //发取消下载按钮
			{
				Start_Download=0;
				Download_Per=0;
				ClearTextValue(6,38);     //清除文本
				SetControState(6,1,1);		 //使能控件	
				SetButtonValue(6,1,0);    //设置按钮为初始状态
				Press_button=0xFF;
			
			}
			if(Last_time_Cloud_Page!=Cloud_Page)
			{
			  sprintf(buf,"%u",Cloud_Page);
				SetTextValue(6,20,(uchar *)buf);     //显示第几页
				Last_time_Cloud_Page=Cloud_Page;
			}
			if(Last_time_SD_Page!=SD_Page)
			{
			  sprintf(buf,"%u",SD_Page);
				SetTextValue(6,21,(uchar *)buf);     //显示第几页
				Last_time_SD_Page=SD_Page;
			}
			if(Press_button==CMD_Delete)
			{
			  //sprintf(buf,"%u",SD_Page);
			  SetTextValue(9,3,(uchar *)file_name);     //显示文件名呢
				Press_button=0xFF;
			}
			if(Press_button==CMD_File_Delete_Sure)
			{
			
			}
		
		}
			break;
//		case Same_file_Error_Page:    //**************************************************同名文件报错页面****************************************************************************************
//			break;
//		case Download_Fail_Pgae:    //***************************************************下载失败提醒页面
//			break;
		case Delete_Page:         //*****************************************************删除页面****************************************************************************************
		{		
			
		}	
		break;
		case Storage_View_Page:    //*****************************************************内存预览页面****************************************************************************************
		{
		
		
		
		}break;	
		case Net_Account_Manage_Page:  //**************************************************网络与账户登录管理**********************************************************************************
			{
				if(WiFi_Password_Right==5)   //WiFi账号和密码正确
				{
				  Network_Control=3;
					WiFi_Password_Right=0;
				}
				if(Account_Password_Right==5) //用户账户和密码正确
				{
					Sign_Control=3;
					Account_Password_Right=0;
				}
				switch(Network_Control)     //网络连接控件显示、隐藏控制
				{
					case 0: break;
					case Show_Disconnect_Network_Control: 
					{
						ShowControl(11,18,1);
						Network_Control=0;
					}break;
					case Hide_Disconnect_Network_Control: 
					{
						ShowControl(11,18,0);
						Network_Control=0;
					}break;				
				}
				//ShowControl(11,4,1);
				switch(Sign_Control)     //账户登录退出控件显示、隐藏控制
				{
					case 0: break;
					case Show_Sign_Out_Control: 
					{
						ShowControl(11,19,1);
						Network_Control=0;
					}break;
					case Hide_Sign_Out_Control: 
					{
						ShowControl(11,19,0);
						Network_Control=0;
					}break;					
				}									
			}
			break;
		case Choose_WiFi_Page:        //*****************************************************选择WiFi页面****************************************************************************************
		{
		  char buf[20];
			if(Last_time_WiFi_Page!=WiFi_Page)
			{
			  sprintf(buf,"%u",WiFi_Page);
				SetTextValue(12,11,(uchar *)buf);     //显示第几页
				Last_time_WiFi_Page=WiFi_Page;
			}	
		}break;
		case Disconnect_Remind_Page: 
			break;
		case SignOut_Remind_Page: 
			break;
		case Cancel_Download_Page:
			break;
		default:
			break;
	}

}

//对来自TFT屏的命令进行分析
void TFT_command_analyse(void)
{
	
	qsize  size = 0;                                             //指令长度 
  size = queue_find_cmd(cmd_buffer,CMD_MAX_SIZE);              //接收到LCD屏的数据，从USART2的指令缓冲区cmd_buffer中获取一条指令，得到指令长度       
	if(size>0 && cmd_buffer[1]!=0x07)                            //接收到指令 ，及判断是否为开机提示
	{                                                                           
		Usart2_Receive_data_handle((PCTRL_MSG)cmd_buffer, size);   //指令分析处理 ，标记应该进入哪个Work_Page_Status，标记相应的操作位
	  Light_mark_button++;                                      //表示屏幕有按键触发，
		
		
		memset(cmd_buffer, 0, CMD_MAX_SIZE);                       //对指令缓冲cmd_buffer清零
	}
}

/****************************************************
*  \brief  消息处理流程
*  \param msg 待处理消息
*  \param size 消息长度
******************************************************/
void Usart2_Receive_data_handle( PCTRL_MSG msg, uint16 size )
{
    get_cmd_type = msg->cmd_type;                                         //获取指令类型
    get_ctrl_msg = msg->ctrl_msg;                                         //获取消息的类型	  
    get_control_type = msg->control_type;                                 //获取控件类型
    get_screen_id = PTR2U16(&msg->screen_id);                             //获取画面ID
    get_control_id = PTR2U16(&msg->control_id);                           //获取控件ID
    get_value = PTR2U32(msg->param);                                      //获取数值
	
	  if(get_control_type==kCtrlButton)                                      //按钮控件
			get_button_state= msg->param[1];                                     //获取按钮状态
   
    if(get_cmd_type==NOTIFY_CONTROL)                                      //控件更新通知
    {  
				switch(get_screen_id)                                             //画面ID
				{
					case Working_Page:                                              //画面0：加工页面
					{
							Work_Page_Status=Working_Page;
							switch(get_control_id)
							{
									case Spindle_Speed_Subtract_Button:                  //主轴速度减
									{
										if(get_button_state)
										{
											  Press_button=CMD_Spindle_Speed_Subtract;
											  Speed.Spindle_Speed_Changed=Changed;
												Speed.Initial_Spindle_Speed_Percent -= 10; 
												if(Speed.Initial_Spindle_Speed_Percent <= 0)
												{
													Speed.Initial_Spindle_Speed_Percent = 0;
												}
												Speed.Changed_Spindle_Speed=Speed.Initial_Spindle_Speed*Speed.Initial_Spindle_Speed_Percent/100;
												get_button_state=0;
									  }
									}break;	
									case Spindle_Speed_Add_Button:                  //主轴速度加
									{
										if(get_button_state)
										{   
											
											  Press_button=CMD_Spindle_Speed_Add;
											  Speed.Spindle_Speed_Changed=Changed;
												Speed.Initial_Spindle_Speed_Percent += 10;
												if(Speed.Initial_Spindle_Speed_Percent >= 100)
												{
													Speed.Initial_Spindle_Speed_Percent = 100;
												}
												Speed.Changed_Spindle_Speed=Speed.Initial_Spindle_Speed*Speed.Initial_Spindle_Speed_Percent/100;
												get_button_state=0;
									  }
									}break;
									case Work_Speed_Subtract_Button:                  //加工速度减
									{
										if(get_button_state)
										{
											  Press_button=CMD_Work_Speed_Suttract;
											  Speed.Work_Speed_Changed=Changed;
												if(Speed.Initial_Work_Speed_Percent <= 100)
												{
													Speed.Initial_Work_Speed_Percent -=10;
													if(Speed.Initial_Work_Speed_Percent <= 0)
													{
														Speed.Initial_Work_Speed_Percent=0;
													}
												}
												else if(100 < Speed.Initial_Work_Speed_Percent && Speed.Initial_Work_Speed_Percent <=300)
												{
													Speed.Initial_Work_Speed_Percent-=25;						
												}
												Speed.Changed_Work_Speed=Speed.Initial_Work_Speed*Speed.Initial_Work_Speed_Percent/100;
		                    get_button_state=0;
									  }												
									}break;
									case Work_Speed_Add_Buttoub:                  //加工速度加
									{
										if(get_button_state)
										{
											  Press_button=CMD_Spindle_Speed_Add;
											  Speed.Work_Speed_Changed=Changed;
												if(Speed.Initial_Work_Speed_Percent < 100)
												{
													Speed.Initial_Work_Speed_Percent +=10;
												}
												else if(100 <= Speed.Initial_Work_Speed_Percent && Speed.Initial_Work_Speed_Percent <=300)
												{
													Speed.Initial_Work_Speed_Percent +=25;
													if(Speed.Initial_Work_Speed_Percent >= 300)
													{
														Speed.Initial_Work_Speed_Percent=300;
													}						
												}
												Speed.Changed_Work_Speed=Speed.Initial_Work_Speed*Speed.Initial_Work_Speed_Percent/100;
												get_button_state=0;
									  }	
									}break;
									case File_Manage_Button1:
										Work_Page_Status=File_Manage_Page;break;
									case Net_Account_Manage_Button1:
										Work_Page_Status=Net_Account_Manage_Page;break;
									case Setting_Button:
										Work_Page_Status=Setting_page;break;
									case Control_Panel_Button:
										Work_Page_Status=ControlPanel_Page;break;
									case X_Press_Button1:                                           //X轴按钮触发
									{																			
										control_panel_pram.Axis_press = CMD_X_AXIS;								
									}break;
									case Y_Press_Button1:                                           //Y轴按钮触发
									{
																				
										control_panel_pram.Axis_press = CMD_Y_AXIS;						
									}break;
									case Z_Press_Button1:                                              //Z轴按钮触发
									{
																			
										control_panel_pram.Axis_press = CMD_Z_AXIS;														
									}break;
									case A_Press_Button1:                                             //A轴按钮触发
									{
																				
										control_panel_pram.Axis_press = CMD_A_AXIS;															
									}break;
									case B_Press_Button1:                                           //B轴按钮触发
									{
																			
										control_panel_pram.Axis_press = CMD_B_AXIS;											
									}break;								
									default:break;
						  }
					}break;
					case Setting_page:                                              //画面1：设置页面
					{
						//char buf[20];
						Work_Page_Status=Setting_page;
						if(state.Work_state==Stop)             //停止加工状态
						{
							switch(get_control_id)                                
							{
									case Safe_Z_Button1:                           //安全Z按钮触发
									{
										if(get_button_state)
											pram_status.Safe_Z_button_satus=1;
										else
											pram_status.Safe_Z_button_satus=0;													
									}break;
									case Auto_kinfe_Button1:                       //自动对刀按钮触发
									{
										if(get_button_state)
											pram_status.Auto_Knife_button_status=1;
										else
											pram_status.Auto_Knife_button_status=0;						
									}break;
									case Uint_Button:                              //单位选择按钮触发
									{
										if(get_button_state)
											pram_status.Unit_Change_button_status=1;
										else
											pram_status.Unit_Change_button_status=0;						
									}break;
									case Voice_button:                           //语音提示按钮触发 
									{
										if(get_button_state)                                
											pram_status.voice_button_status=voice_off; //按钮按下，语音提醒关
										else
											pram_status.voice_button_status=voice_on;  //按钮松开，语音提醒开													
									}break;
									case BackLight_button:                          //背光按钮 
									{
										Work_Page_Status=BackLight_Adjust_Page;												
									}break;
									case Softlimit_button:                           //软限位设定按钮 
									{
										Work_Page_Status=Setting_Page_2;												
									}break;
									case Working_button:                             //加工页面按钮
									{
										Work_Page_Status=Working_Page;						
									}break;
									case File_Manage_Button:                         //文件管理按钮
									{
										 Work_Page_Status=File_Manage_Page;					
									}break;
									case Net_Account_Manage_Button5:                  //网络账户管理按钮
									{
										 Work_Page_Status=Net_Account_Manage_Page;					
									}break;
									case Safe_Z_Setting:                          //获取安全Z高度
									{
										
										pram_status.Safe_Z_num=NotifyText(msg->param);										
//										sprintf(buf,"Safe_Z:%.2f",pram_status.Safe_Z_num);    
									}										
									break;
									case knife_height_Setting:                   //获取对刀高度
									{
										
										pram_status.Knife_high_num=NotifyText(msg->param);										
//										sprintf(buf,"Knife_high:%.2f",pram_status.Knife_high_num);
//		                Usart_SendString(USART2,(char *)buf);       
									}										
									break;
									case knife_Block_height_Setting:                     //获取对刀块高度
									{
										
