pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
										pram_status.Knife_block_high_num=NotifyText(msg->param);										
//										sprintf(buf,"Knife_block_high:%.2f",pram_status.Knife_block_high_num);
//		                Usart_SendString(USART2,(char *)buf);     
									}										
									break;
									case knife_height_X1:                  //获取对刀块X轴位置
									{
										
										pram_status.Auto_Knife_block_X=NotifyText(msg->param);										
//										sprintf(buf,"Knife_block_X:%.2f",pram_status.Auto_Knife_block_X);
//		                Usart_SendString(USART2,(char *)buf);       
									}										
									break;
									case knife_height_Y1:                 //获取对刀块Y轴位置
									{
										
										pram_status.Auto_Knife_block_Y=NotifyText(msg->param);										
//										sprintf(buf,"Knife_block_Y:%.2f",pram_status.Auto_Knife_block_Y);
//		                Usart_SendString(USART2,(char *)buf);       
									}										
									break;
									case knife_height_Z1:                 //获取对刀块Z 轴位置
									{
										
										pram_status.Auto_Knife_block_Z=NotifyText(msg->param);										
//										sprintf(buf,"Knife_block_Z:%.2f",pram_status.Auto_Knife_block_Z);
//		                Usart_SendString(USART2,(char *)buf);      
									}										
									break;
//									case 12:                  //获取软限位X轴位置
//									{
//										
//										pram_status.Soft_limit_X=NotifyText(msg->param);										
////										sprintf(buf,"Soft_limit_X:%.2f",pram_status.Soft_limit_X);
////		                Usart_SendString(USART2,(char *)buf);      
//									}										
//									break;
//									case 13:                   //获取软限位Y轴位置
//									{
//										
//										pram_status.Soft_limit_Y=NotifyText(msg->param);										
////										sprintf(buf,"Soft_limit_Y:%.2f",pram_status.Soft_limit_Y);
////		                Usart_SendString(USART2,(char *)buf);      
//									}										
//									break;
//									case 14:                 //获取软限位Z轴位置
//									{
//										
//										pram_status.Soft_limit_Z=NotifyText(msg->param);										
////										sprintf(buf,"Soft_limit_Z:%.2f",pram_status.Soft_limit_Z);
////		                Usart_SendString(USART2,(char *)buf);      
//									}										
//									break;
//									case 15:                 //获取软限位A轴位置
//									{ 
//										
//										pram_status.Soft_limit_A=NotifyText(msg->param);										
////										sprintf(buf,"Soft_limit_A:%.2f",pram_status.Soft_limit_A);
////		                Usart_SendString(USART2,(char *)buf);     
//									}										
//									break;
//									case 16:                  //获取软限位B轴位置
//									{
//										
//										pram_status.Soft_limit_B=NotifyText(msg->param);										
////										sprintf(buf,"Soft_limit_B:%.2f",pram_status.Soft_limit_B);
////		                Usart_SendString(USART2,(char *)buf);       
//									}										
//									break;							
									default: break;		
                 }									
						}					
					}break;  
          case Setting_Page_2:                                              //画面2：设置页面
					{
						//char buf[20];
						Work_Page_Status=Setting_page;
						if(state.Work_state==Stop)             //停止加工状态
						{
							switch(get_control_id)                                
							{
									case Safe_Z_Button3:                           //安全Z按钮触发
									{
										if(get_button_state)
											pram_status.Safe_Z_button_satus=1;
										else
											pram_status.Safe_Z_button_satus=0;													
									}break;
									case Uint_Button2:                              //单位选择按钮触发
									{
										if(get_button_state)
											pram_status.Unit_Change_button_status=1;
										else
											pram_status.Unit_Change_button_status=0;						
									}break;
									case Auto_kinfe_Button3:                       //自动对刀按钮触发
									{
										if(get_button_state)
											pram_status.Auto_Knife_button_status=1;
										else
											pram_status.Auto_Knife_button_status=0;						
									}break;
									case Voice_button1:                            //语音提示按钮触发 
									{
										if(get_button_state)                                
											pram_status.voice_button_status=voice_off; //按钮按下，语音提醒关
										else
											pram_status.voice_button_status=voice_on;  //按钮松开，语音提醒开													
									}break;
									case BackLight_button2:                          //背光按钮 
									{
										Work_Page_Status=BackLight_Adjust_Page;												
									}break;
									case Softlimit_button2:                           //软限位设定按钮 
									{
										Work_Page_Status=Setting_Page_2;												
									}break;
									case Working_button2:                             //加工页面按钮
									{
										Work_Page_Status=Working_Page;						
									}break;
									case File_Manage_Button6:                         //文件管理按钮
									{
										 Work_Page_Status=File_Manage_Page;					
									}break;
									case Net_Account_Manage_Button6:                  //网络账户管理按钮
									{
										 Work_Page_Status=Net_Account_Manage_Page;					
									}break;
									case Safe_Z_Setting2:                              //获取安全Z高度
									{
											pram_status.Safe_Z_num=NotifyText(msg->param);										
//										sprintf(buf,"Safe_Z:%.2f",pram_status.Safe_Z_num);    
									}										
									break;
									case knife_height_Setting2:                         //获取对刀高度
									{
											pram_status.Knife_high_num=NotifyText(msg->param);										
//										sprintf(buf,"Knife_high:%.2f",pram_status.Knife_high_num);
//		                Usart_SendString(USART2,(char *)buf);       
									}										
									break;
									case knife_Block_height_Setting2:                  //获取对刀块高度
									{								
										pram_status.Knife_block_high_num=NotifyText(msg->param);										
//										sprintf(buf,"Knife_block_high:%.2f",pram_status.Knife_block_high_num);
//		                Usart_SendString(USART2,(char *)buf);     
									}										
									break;
									case Soft_Limit_X1:                  //获取软限位X轴位置1
									{
										
										pram_status.Soft_limit_X1=NotifyText(msg->param);										
//										sprintf(buf,"Soft_limit_X:%.2f",pram_status.Soft_limit_X);
//		                Usart_SendString(USART2,(char *)buf);      
									}										
									break;
									case Soft_Limit_X2:                  //获取软限位X轴位置2
									{
										
										pram_status.Soft_limit_X2=NotifyText(msg->param);										
//										sprintf(buf,"Soft_limit_X:%.2f",pram_status.Soft_limit_X);
//		                Usart_SendString(USART2,(char *)buf);      
									}										
									break;
									case Soft_Limit_Y1:                 //获取软限位Y轴位置1
									{
										
										pram_status.Soft_limit_Y1=NotifyText(msg->param);										
//										sprintf(buf,"Soft_limit_Y:%.2f",pram_status.Soft_limit_Y);
//		                Usart_SendString(USART2,(char *)buf);      
									}										
									break;
									case Soft_Limit_Y2:                 //获取软限位Y轴位置2
									{
										
										pram_status.Soft_limit_Y2=NotifyText(msg->param);										
//										sprintf(buf,"Soft_limit_Y:%.2f",pram_status.Soft_limit_Y);
//		                Usart_SendString(USART2,(char *)buf);      
									}										
									break;
									case Soft_Limit_Z1:               //获取软限位Z轴位置1
									{
										
										pram_status.Soft_limit_Z1=NotifyText(msg->param);										
//										sprintf(buf,"Soft_limit_Z:%.2f",pram_status.Soft_limit_Z);
//		                Usart_SendString(USART2,(char *)buf);      
									}										
									break;
									case Soft_Limit_Z2:                 //获取软限位Z轴位置2
									{ 
										
										pram_status.Soft_limit_Z2=NotifyText(msg->param);										
//										sprintf(buf,"Soft_limit_A:%.2f",pram_status.Soft_limit_A);
//		                Usart_SendString(USART2,(char *)buf);     
									}										
									break;
									case Soft_Limit_A1:                  //获取软限位A轴位置1
									{
										
										pram_status.Soft_limit_A1=NotifyText(msg->param);										
//										sprintf(buf,"Soft_limit_B:%.2f",pram_status.Soft_limit_B);
//		                Usart_SendString(USART2,(char *)buf);       
									}										
									break;
									case Soft_Limit_A2:                  //获取软限位A轴位置2
									{
										
										pram_status.Soft_limit_A2=NotifyText(msg->param);										
//										sprintf(buf,"Soft_limit_B:%.2f",pram_status.Soft_limit_B);
//		                Usart_SendString(USART2,(char *)buf);       
									}										
									break;
									case Soft_Limit_B1:                  //获取软限位B轴位置1
									{
										
										pram_status.Soft_limit_B1=NotifyText(msg->param);										
//										sprintf(buf,"Soft_limit_B:%.2f",pram_status.Soft_limit_B);
//		                Usart_SendString(USART2,(char *)buf);       
									}										
									break;
									case Soft_Limit_B2:                  //获取软限位B轴位置2
									{
										
										pram_status.Soft_limit_B2=NotifyText(msg->param);										
//										sprintf(buf,"Soft_limit_B:%.2f",pram_status.Soft_limit_B);
//		                Usart_SendString(USART2,(char *)buf);       
									}										
									break;						
									default: break;		
               }									
						}					
					}break; 					
					case ControlPanel_Page:                                         //画面3：控制面板
					{
						  static uint16 press_time=0;
	            char buf5[10];
						
							Work_Page_Status=ControlPanel_Page;
							switch(get_control_id)
							{
								case Return_Workpiece_Zero_Button:                          //回工件零按钮触发
									{
										if(get_button_state)    
										{
											Work_Page_Status=Return_WorkPiece_Zero_Page;
											first_time_re_workpiece=1;
											Press_button = CMD_Return_WorkPiece_Zero;
											press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);
											
