pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
										}
									}break;
									 case Return_Machine_Zero_Button:                            //回机械零按钮触发	
                  {
										if(get_button_state)
										{
											Press_button = CMD_Return_Machine_Zero;
											press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);
																							
										}	
									}break; 
									case Divided_Button:                                         //分中按钮触发
									{
											if(get_button_state)
											{
												Press_button = CMD_Divided;	
												press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);
												
											}
											
									}break;
									case Auto_kinfe_Button2:                                     //对刀按钮触发
									{										
											if(get_button_state)
											{
												Press_button = CMD_Auto_knife;
												press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);
												
											}
											
									}break;
									case Jump_Work_Button:                                      //跳行加工按钮触发
									{
										if(get_button_state)
										{
											jump_work_set.First_get_into = 1;
											Work_Page_Status=Jump_Work_Page;
											Press_button = CMD_Jump_Work;
											press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);
											
										}
									}break;
									case Safe_Z_Button2:                                         // 安全Z开关
									{									
											Press_button = CMD_Safe_Z;
										press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);
                										
																			
									}break;
									case Soft_Limit_button:                                      //软限位开关按钮触发
									{											
								
											Press_button = CMD_Soft_Limit;	
                      press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);											
											
									}break;
									case Coordinate_Button:                                      //坐标切换按钮触发
									{
											if(get_button_state)
											{										
												  Coordinate_Change_Process();   //坐标切换控制
												  Press_button = CMD_Coordinate_Change;
												press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);
												 
											 }										
									}break;
									case All_Clear_Button:                                       //全轴清零按钮触发
									{
                    if(get_button_state)   
										{										
											control_panel_pram.All_Spindle_Clear_Button=1;
											Press_button = CMD_All_Spin_Clear;
											press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);
											
										}
									}break;
                  case Clear_Botton:                                           //清零按钮触发
									{
										if(get_button_state)
										{										
											Press_button = CMD_Clear;	
                      press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);											
										}																					
									}break;    
                  case Spin_Button:                                             //主轴开关按钮触发
									{
											Press_button = CMD_Spin_On_Off;	
                      press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);										
                      											
									
									}break;                            									
									case Multiple_Button:								                           //倍率切换按钮触发
									{
										if(get_button_state)
										{
												control_panel_pram.Multiple_Change_button=1;
												Multiple_Change_Process();                    //倍率切换控制
												Press_button = CMD_Multiple_Change;	
                      press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);											
										}
																		
									}break;							
									case Start_Button1:                                           //开始按钮触发
									{
										state.Work_state=Start;
										Press_button = CMD_Start;
										TIM_Cmd(TIM4, DISABLE);      //禁止 TIM4
//										SetButtonValue(2,14,0);     //停止按钮松开状态
										SetButtonValue(2,13,1);       //开始按钮按下状态
										press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);
										
									}break;
									case Reset_Button:                                            //复位按钮触发
									{
										state.Work_state=Stop;
										Press_button = CMD_Reset;  						
									}break;
									case Stop_Button:                                           //停止按钮触发
									{
										state.Work_state=Stop;
//										SetButtonValue(2,13,0);     //开始按钮松开状态
										SetButtonValue(2,14,1);     //停止按钮按下状态
                    Press_button = CMD_Stop;
									  TIM_Cmd(TIM4, ENABLE);      //使能 TIM4
										press_time++;
											sprintf(buf5,"P:%u",press_time);	
											SetTextValue(3,28,(uchar *)buf5);
																	
									}break;								
									case Exit_Contronl_Panel_Button:                                          //退出控制面板按钮触发
									{
										Work_Page_Status=Working_Page;
									}
									break;
									case X_Press_Button2:                                            //X轴按钮触发
									{	
																											
										control_panel_pram.Axis_press = CMD_X_AXIS;								
									}break;
									case Y_Press_Button2:                                            //Y轴按钮触发
									{
																		
										control_panel_pram.Axis_press = CMD_Y_AXIS;						
									}break;
									case Z_Press_Button2:                                              //Z轴按钮触发
									{
															
										control_panel_pram.Axis_press = CMD_Z_AXIS;														
									}break;
									case A_Press_Button2:                                             //A轴按钮触发
									{
																	
										control_panel_pram.Axis_press = CMD_A_AXIS;															
									}break;
									case B_Press_Button2:                                           //B轴按钮触发
									{  
																	
										control_panel_pram.Axis_press = CMD_B_AXIS;											
									}break; 
									case File_Manage_Button2:                                     //文件管理按钮
									{
									   Work_Page_Status=File_Manage_Page;
									}break;									
									case Net_Account_Manage_Button2:                             //网络账户管理
									{
									   Work_Page_Status=Net_Account_Manage_Page;
									}break;
									case Set_Button:                                             //设置按钮
									{
									  Work_Page_Status=Setting_page;
									}break;
									default:break;				
							}
					}break;
					case Return_WorkPiece_Zero_Page:                                //画面4：回工件零页面
					{
						Work_Page_Status=Return_WorkPiece_Zero_Page;
						if(state.Work_state==Stop)    //停止加工状态
						{
							switch(get_control_id)                                
							{
									case All_Spindle_Button:                  //全轴按钮触发
									{
										if(get_button_state)            //按钮是按下状态  
										{
											return_workpiece_zero.all_spindle_status=1; //此时全轴按钮按下，XYZAB轴显示成没有选中状态
											SetButtonValue(3,4,1);
											SetButtonValue(3,5,1);
											SetButtonValue(3,6,1);
											SetButtonValue(3,7,1);
											SetButtonValue(3,8,1);
											return_workpiece_zero.X_clear_status=1;
											return_workpiece_zero.Y_clear_status=1;
											return_workpiece_zero.Z_clear_status=1;
											return_workpiece_zero.A_clear_status=1;
											return_workpiece_zero.B_clear_status=1;										
										}
										else 
										{
											return_workpiece_zero.all_spindle_status=0;
											return_workpiece_zero.X_clear_status=0;
											return_workpiece_zero.Y_clear_status=0;
											return_workpiece_zero.Z_clear_status=0;
											return_workpiece_zero.A_clear_status=0;
											return_workpiece_zero.B_clear_status=0;
											
