pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
										}
									
									}break;
									case Cancel_Button2:                     //取消按钮触发
									{
									  TIM_Cmd(TIM4, ENABLE);      //使能 TIM4
										if(get_button_state) 
										{
											return_workpiece_zero.Cancel=1;  //取消按钮按下											
										}
										else
										{
											return_workpiece_zero.Cancel=0;  //取消按钮松开
											Work_Page_Status=ControlPanel_Page;
											
										}										
									
									}break;
									case Sure_Button2:                   //确定按钮触发
									{
										TIM_Cmd(TIM4, ENABLE);      //使能 TIM4
										if(get_button_state) 
										{
											return_workpiece_zero.Sure=1;  //确定按钮按下											
										}
										else
										{
											Work_Page_Status=ControlPanel_Page;
										}
																		
									}break;
									case X_Press_Button3:                           //X轴按钮触发
									{
										if(get_button_state) 
										{											
										  return_workpiece_zero.X_clear_status=1;
										}
										else
										{
											return_workpiece_zero.X_clear_status=0;
											return_workpiece_zero.all_spindle_status=0;
										}
									
									}break;
									case Y_Press_Button3:                           //Y轴按钮触发
									{
										if(get_button_state) 
										{											
										  return_workpiece_zero.Y_clear_status=1;
										}
										else
										{
											return_workpiece_zero.Y_clear_status=0;
											return_workpiece_zero.all_spindle_status=0;
										}
									
									}break;
									case Z_Press_Button3:                           //Z轴按钮触发
									{
										if(get_button_state)
										{											
										  return_workpiece_zero.Z_clear_status=1;
										}
										else
										{
											return_workpiece_zero.Z_clear_status=0;
											return_workpiece_zero.all_spindle_status=0;
										}
									
									}break;
									case A_Press_Button3:                           //A轴按钮触发
									{
										if(get_button_state)
										{											
										  return_workpiece_zero.A_clear_status=1;
										}
										else
										{
											return_workpiece_zero.A_clear_status=0;
											return_workpiece_zero.all_spindle_status=0;
										}
									
									}break;
									case B_Press_Button3:                           //B轴按钮触发
									{
										if(get_button_state)
										{											
										  return_workpiece_zero.B_clear_status=1;
										}
										else
										{
											return_workpiece_zero.B_clear_status=0;
                      return_workpiece_zero.all_spindle_status=0;											
										}											
									}break;
									case 9:                    //通过数字键盘更改X轴坐标值
									{
									  
										return_workpiece_zero.Re_X_Value = NotifyText(msg->param);     //获取新坐标值
										return_workpiece_zero.X_get_value = 1;                         //获取到新坐标值，标志位置1
										control_panel_pram.X_value = return_workpiece_zero.Re_X_Value;
										
									}break;
									case 10:                 //通过数字键盘更改Y轴坐标值
									{
									  
										return_workpiece_zero.Re_Y_Value = NotifyText(msg->param);
										return_workpiece_zero.Y_get_value = 1;                         //获取到新坐标值，标志位置1
										control_panel_pram.Y_value = return_workpiece_zero.Re_Y_Value;
									}break;
									case 11:                  //通过数字键盘更改Z轴坐标值
									{
									 
										return_workpiece_zero.Re_Z_Value = NotifyText(msg->param);
										return_workpiece_zero.Z_get_value = 1;                         //获取到新坐标值，标志位置1
										control_panel_pram.Z_value = return_workpiece_zero.Re_Z_Value;	

									}break;
									case 12:                  //通过数字键盘更改A轴坐标值
									{
									  
										return_workpiece_zero.Re_A_Value = NotifyText(msg->param);
										return_workpiece_zero.A_get_value = 1;                         //获取到新坐标值，标志位置1
										control_panel_pram.A_value = return_workpiece_zero.Re_A_Value;
									}break;
									case 13:                  //通过数字键盘更改B轴坐标值
									{
									  
										return_workpiece_zero.Re_B_Value = NotifyText(msg->param);
										return_workpiece_zero.B_get_value = 1;                         //获取到新坐标值，标志位置1
										control_panel_pram.B_value = return_workpiece_zero.Re_B_Value;

									}break;
									default:break;
							}
						}
						else
						{
						
						}
					}break; 
					case Jump_Work_Page:                                            //画面5:跳行加工页面
					{
						switch(get_control_id)
						{
							case Sure_Button3:                         //确定按钮触发
							{
							  jump_work_set.Jump_Work_Sure = 1;
								jump_work_set.Jump_Work_cancel = 0;
								Working_line = jump_work_set.New_work_line;
								Work_Page_Status = ControlPanel_Page;
							}break;
							case Cancel_Button3:                        //取消按钮触发
							{
							  jump_work_set.Jump_Work_cancel = 1;
								jump_work_set.Jump_Work_Sure = 0;
								Work_Page_Status = ControlPanel_Page;
							}break;
							case 3:                        //获取新的行数
							{
							  jump_work_set.New_work_line=NotifyText(msg->param);
							}break;
						}
						
					}break;              
					case File_Manage_Page:                                           //画面6:文件管理
					{
						Work_Page_Status=File_Manage_Page;
						switch(get_control_id)
						{
							case Download_button:                               //下载按钮触发
							{
							  if(get_button_state)
								{
									Press_button = CMD_Download;								
								}
							}
							break;
							case Canael_Download_button:                  //取消下载按钮触发
							{
							   Work_Page_Status=Cancel_Download_Page;
							}
							break;
							case Delete_Button:                         //删除按钮触发
							{
								Work_Page_Status=Delete_Page;
							  if(get_button_state)
								{									
									Press_button = CMD_Delete;	                 								
								}
							}
							break;
							case Storage_button:                        //内存预览按钮触发
              {
								Work_Page_Status=Storage_View_Page;
							  if(get_button_state)
								{
									Press_button = CMD_Storage_View;								
								}
							}								
							break;
							case Open_and_Load_Button:                //打开加载按钮触发
							{
								Work_Page_Status=ControlPanel_Page;
							}break;
							case Cloud_Last_Page_button:              //云空间上一页按钮触发
							{
							  if(get_button_state)
								{
									if(Cloud_Page>1)
								    Cloud_Page--;
								}
							}	
							break;
							case Cloud_Next_Page_button:          //云空间下一页按钮触发
							{
							  if(get_button_state)
								{
								  Cloud_Page++;
								}
							}
								break;
							case SD_Last_Page_button:              //SD卡上一页按钮触发
							{
							  if(get_button_state)
								{
								  if(SD_Page>1)
								    SD_Page--;
								}
							}
								break;
							case SD_Next_Page_button:              //SD卡下一页按钮触发
							{
							  if(get_button_state)
								{
								  SD_Page++;
								}
							}
								break;
							case Cloud_file_1:
								Cloud_File_Button=0X01;break;
							case Cloud_file_2:
								Cloud_File_Button=0X02;break;
							case Cloud_file_3:
								Cloud_File_Button=0X03;break;
							case Cloud_file_4:
								Cloud_File_Button=0X04;break;
							case SD_file_1:
								SD_File_Button=0X01;break;
							case SD_file_2:
								SD_File_Button=0X02;break;
							case SD_file_3:
								SD_File_Button=0X03;break;
							case SD_file_4:
								SD_File_Button=0X04;break;
							
							case Working_Page_button3:
								Work_Page_Status=Working_Page;break;
							case Net_Account_Manage_Button3:
								Work_Page_Status=Net_Account_Manage_Page;break;
							case Set_Button2:
								Work_Page_Status=Setting_page;break;
							default:break;
						}
					}break;
					case Same_file_Error_Page:                                       //画面7：同名文件报错页面
					{
						Work_Page_Status=Same_file_Error_Page;
//						if(get_control_id==)
					}break; 
					case Download_Fail_Pgae:                                       //画面8：下载失败页面
					{
						Work_Page_Status=Download_Fail_Pgae;
					}break;    
					case Delete_Page:                                              //画面9：删除页面
					{	
						switch(get_control_id)
						{
					    case Sure_Button4:        //确定按钮触发
							{
							  if(get_button_state)
								{
									Work_Page_Status=File_Manage_Page;
									Press_button = CMD_File_Delete_Sure;								
								}
							}break;
							case Cancel_Button4:   //取消
							{								
								Work_Page_Status=File_Manage_Page;
							}break;
							
