pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
						}
					}
					break;
					case Storage_View_Page:                                      //画面10：内存空间预览页面
					{
						Work_Page_Status=Storage_View_Page;
						switch(get_control_id)
						{
					    case Net_Account_Manage_Button4:                      //网络账户页面按钮触发
							{
							  if(get_button_state)
								{
									Work_Page_Status=Net_Account_Manage_Page;							
								}
							}break;
							case Working_Page_button1:                           //加工页面按钮触发
							{								
								Work_Page_Status=Working_Page;
							}break;
							case Return_File_Manage_Button:                     //会文件管理按钮触发
							{
							   Work_Page_Status=File_Manage_Page;
							}break;
							case Set_Button4:                                   //设置按钮
								Work_Page_Status=Setting_page;break;
							default:break;
						}
						
					}break;  
					
					case Net_Account_Manage_Page:                                       //画面11：网络账户管理
					{
						Work_Page_Status=Net_Account_Manage_Page;
						switch(get_control_id)
						{
							case Working_Page_button2: Work_Page_Status=Working_Page;break;
							case File_Manage_Button4: Work_Page_Status=File_Manage_Page;break;
							case Choose_WiFi_Button: Work_Page_Status=Choose_WiFi_Page;break;
							case Connect_WiFi_Button: 
							{
							  if(get_button_state)
								{
									WiFi_Password_Right++;								
								}
							
							}break;
							case Sign_In_Button:
							{
							  if(get_button_state)
								{
									Account_Password_Right++;								
								}
							
							}
							case Disconnect_WIFI_Button: Work_Page_Status=Disconnect_Remind_Page;break;
							case Sign_Out_Button: Work_Page_Status=SignOut_Remind_Page;break;
							case Set_Button3: Work_Page_Status=Setting_page;break;
							default:break;
						}
					}break;
					case Choose_WiFi_Page:                                                 //画面12：选择WiFi
   				{
						Work_Page_Status=Choose_WiFi_Page;
						switch(get_control_id)
						{
							case WiFi_1_Button: 
							{
							  Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case WiFi_2_Button: 
							{
							  Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case WiFi_3_Button: 
							{
							  Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case WiFi_4_Button: 
							{
								Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case WiFi_Next_Page_Button:
							{
							  if(get_button_state)
								{
								    WiFi_Page++;
								}
							}break;
							case WiFi_Last_Page_Button: 
							{
								if(get_button_state)
								{
									if(WiFi_Page>1)
								    WiFi_Page--;
								}
							}break;
							default:break;
						}
					}break;      
				 case BackLight_Adjust_Page:                                             //画面13：背光亮度调整
				 {
				 
				 }
					
					case Disconnect_Remind_Page:                                            //画面15：断开网络提醒页面
					{
						switch(get_control_id)
						{
							case Sure_Button5:       //确定按钮触发
							{								
								Network_Control=4;
								Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case Cancel_Button5:   //取消按钮触发
							{
								Work_Page_Status=Net_Account_Manage_Page;
							}break;
						}
					}break;     
					case SignOut_Remind_Page:                                                //画面16：退出登录提醒页面
					{
					  switch(get_control_id)
						{
							case Sure_Button6:        //确定按钮触发
							{
								Sign_Control=4;
							  Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case Cancel_Button6:      //取消按钮触发
							{
								Work_Page_Status=Net_Account_Manage_Page;
							}break;
						}
					}	
					break;         
					case Cancel_Download_Page:                                                //画面20：取消下载提醒
					{
            switch(get_control_id)
						{
							case Sure_Button7:                                    //确定取消下载
							{
							  if(get_button_state)
								{
									Press_button = CMD_Cancel_Download;
                  Work_Page_Status=File_Manage_Page;									
								}
							}
							break;
							case Cancel_Button7: 
							{
							  if(get_button_state)
								{
									Press_button = 0xFF;
                  Work_Page_Status=File_Manage_Page;									
								}
							}
							break;
							
					  }
					}break;
//					case Save_Pram_Page:                                                    //画面21 保存参数设置提醒页面
//					{
//						Work_Page_Status=Save_Pram_Page;
//						if(state.Work_state==Stop)    //停止加工状态
//						{
//								switch(get_control_id)
//								{
//									case Sure_Button8:    //确定按钮触发
//									{							
//										pram_status.Save_Pram_Page_Sure_button=1;
//										pram_status.Save_Pram_Page_concel_button=0;
//									}break;
//									case Cancel_Button8:   //取消按钮触发
//									{
//										pram_status.Save_Pram_Page_Sure_button=0;
//										pram_status.Save_Pram_Page_concel_button=1;						
//									}
//									default: break;	
//								}
//					  }
//					}break;
					default: break;						
  			}
        
     }
		 
}

/*! 
*  \brief  文本控件通知
*  \details  当文本通过键盘更新(或调用GetControlValue)时，执行此函数
*  \details  文本控件的内容以字符串形式下发到MCU，如果文本控件内容是浮点值，
*  \details  则需要在此函数中将下发字符串重新转回浮点值。
*  \param str 文本控件内容
*  \pram  value 存放文本内容
*/
float NotifyText(uint8 *str)
{                                                                          
		float value=0;                                                            
		sscanf((char *)str,"%f",&value);            
    return  value;                                                                      
}                                                                                



//主机工作状态显示
void Work_state_control(void)
{
  if(last_time_work_state!=state.Work_state)     //判断工作状态是否发生变化，发生变化则进行处理
	{
		if(state.Work_state==Start)         
		{
			Show_Start_Working(Work_Page_Status);      //TFT屏显示当前处于加工状态
		}
		else                                 
		{
			Show_Stop_Working(Work_Page_Status);        //TFT屏显示当前已经停止加工
		}
		last_time_work_state=state.Work_state;
	}

