pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
}

//显示机器已经停止加工
void Show_Stop_Working(uint8 state)
{
	if(state==0)
	  AnimationPlayFrame(0,11,0);
	else if(state==1)
	  AnimationPlayFrame(1,28,0);
	else if(state==2)
	  AnimationPlayFrame(2,43,0);
	else if(state==6)
	  AnimationPlayFrame(6,33,0);
	else if(state==10)
	  AnimationPlayFrame(10,5,0);
	else if(state==11)
	  AnimationPlayFrame(11,13,0);
}
//显示机器正在加工
void Show_Start_Working(uint8 state)
{
	if(state==0)
		AnimationPlayFrame(0,11,1);
	else if(state==1)
		AnimationPlayFrame(1,28,1);
	else if(state==2)
		AnimationPlayFrame(2,43,1);
	else if(state==6)
		AnimationPlayFrame(6,33,1);
	else if(state==10)
		AnimationPlayFrame(10,5,1);
	else if(state==11)
		AnimationPlayFrame(11,13,1);
	
}


//XYZAB坐标按钮复位
void XYZAB_button_reset(void)
{
	uint8 i;
	for(i=22;i<27;i++)
	{
		SetButtonValue(2,i,0);           
	}
}

//开机画面设置
void Power_On_Set(void)
{
	uint8 i=0;
	char buf[6];
	SetScreen(17);           //切换到开机画面
	delay_ms(500); 
		
	for(i=0;i<50;i++)
	{
		SetProgressValue(17,3,i*2);     //设置进度条的值
		delay_ms(5);                    //延时0.05秒
	}
	SetScreen(3);                    //切换到控制面板页面
	//SetTouchPaneOption(1,1,0,0);     //触摸屏设置
	delay_ms(10);
	
	SetTextValue(0,27,"G54");        //设置当前坐标值：G54
	SetTextValue(3,30,"G54");
	SetTextValue(0,28,"关");         //设置手轮引导“关”
	SetTextValue(3,31,"关");
	SetTextValue(0,29,"X10");         //设置倍率：X10
	SetTextValue(3,32,"X10");
	Multiple_num=10;                   //开机默认倍率
	
	Speed.Initial_Spindle_Speed=20000;                     //主轴初始转速
	Speed.Initial_Spindle_Speed_Percent=100;               //主轴初始速度百分比
	Speed.Initial_Work_Speed=1000;                         //加工初始速度
	Speed.Initial_Work_Speed_Percent=100;                  //加工初始速度百分比
	Speed.Changed_Spindle_Speed=20000;                     //变化后的主轴转速              
	Speed.Changed_Work_Speed=1000;                         //变化后的加工速度
	
	SetProgressValue(0,1,Speed.Initial_Spindle_Speed_Percent);  //主轴速度进度条初始化：100%
	sprintf(buf,"%d",Speed.Initial_Spindle_Speed);
	SetTextValue(0,24,(uchar *)buf);                            //主轴速度文本框初始化：20000
	

	SetProgressValue(0,2,Speed.Initial_Work_Speed_Percent);	     //加工速度进度条初始化：100%
	sprintf(buf,"%d",Speed.Initial_Work_Speed_Percent);
	SetTextValue(0,39,(uchar *)buf);                             //加工速度进度条初始化：100%	      
	sprintf(buf,"%d",Speed.Initial_Work_Speed);
	SetTextValue(0,25,(uchar *)buf);                             //加工速度文本框初始化：100%
	   
	
	SetButtonValue(3,13,0);          //开始按钮是松开状态
	SetButtonValue(3,15,1);          //停止按钮是按下状态
	
	Work_Page_Status=ControlPanel_Page;    //开机进入控制面板页面
	
	control_panel_pram.Axis_press = CMD_X_AXIS;
	SetButtonValue(0,42,1);           //X轴选中状态
	SetButtonValue(3,22,1);
	
	
	//SetPowerSaving(1,200,50,30);  // 自动调节背光亮度


}



//加工中心主轴速度和加工速度按钮处理
void Spindle_and_Work_Speed_Key_Process(void)
{
	char buf[10];
  if(Speed.Spindle_Speed_Changed==Changed)
	{
		Speed.Spindle_Speed_Changed=Unchanged;
		sprintf(buf,"%d",Speed.Changed_Spindle_Speed);
		SetTextValue(0,24,(uchar *)buf);                                 //修改主轴速度文本框数值		               
		SetProgressValue(0,1,Speed.Initial_Spindle_Speed_Percent);       //修改主轴速度进度条数值
		
	}
	if(Speed.Work_Speed_Changed==Changed)
	{
		Speed.Work_Speed_Changed=Unchanged;
		sprintf(buf,"%d",Speed.Changed_Work_Speed);
		SetTextValue(0,25,(uchar *)buf);                                   //修改加工速度文本框数值
		SetProgressValue(0,2,Speed.Initial_Work_Speed_Percent);            //修改加工速度进度条数值	
		sprintf(buf,"%d",Speed.Initial_Work_Speed_Percent);
		SetTextValue(0,39,(uchar *)buf);  
		
	}
}

//设置页面语音提示按钮触发后处理程序
void Speaker_Key_Process(uint8  state)
{
	if(state==voice_off)        //喇叭音量调到0；EE 93 00 FF FC FF FF
	{
		 SpeakerControl(0);
		 SetButtonValue(1,27,1);
		 pram_status.Voice_last_status=voice_off;
	}
	else                        //喇叭音量调到最大：EE 93 64 FF FC FF FF 
	{
		 SpeakerControl(100);
		 SetButtonValue(1,27,0);
     pram_status.Voice_last_status=voice_on;	
	}
	AT24CXX_WriteOneByte(0,pram_status.Voice_last_status);
//	FLASH_WriteByte(START_ADDR1,(uint16)pram_status.Voice_last_status);
}



//设置页面安全Z按钮触发后处理程序
void Safe_Z_process(uint8 state)
{
	if(state)                  //模式2（按钮按下状态）
	{
		SetButtonValue(1,1,1);
	  pram_status.Safe_Z_last_status=1;
//		Usart_SendString(USART2,"Safe_z:mode2"); 
	}
	else
	{
		SetButtonValue(1,1,0);      //模式1
	  pram_status.Safe_Z_last_status=0;
//		Usart_SendString(USART2,"Safe_z:mode1"); 
	}
	AT24CXX_WriteOneByte(1,pram_status.Safe_Z_last_status);
//	FLASH_WriteByte(START_ADDR2,(uint16)pram_status.Safe_Z_last_status);
}



//设置页面自动对刀按钮触发后处理程序
void Auto_Knife_process(uint8 state)
{
  if(state)                  //模式2（按钮按下状态）
	{
		SetButtonValue(1,2,1);
	  pram_status.Auto_Knife_last_status=1;
//		Usart_SendString(USART2,"Auto_Knife:mode2");
	}
	else
	{
		SetButtonValue(1,2,0);      //模式1
	  pram_status.Auto_Knife_last_status=0;
//		Usart_SendString(USART2,"Auto_Knife:mode2");
	}
	AT24CXX_WriteOneByte(2,pram_status.Auto_Knife_last_status);
//	FLASH_WriteByte(START_ADDR3,(uint16)pram_status.Auto_Knife_last_status);
}
//设置页面单位切换按钮触发后处理程序
void Unit_Change_process(uint8 state)
{
	if(state )                  //模式2（按钮按下状态:英制）
	{
		SetButtonValue(1,3,1);
	  pram_status.Unit_Change_last_status=1;
//		Usart_SendString(USART2,"Unit:mode2");
	}
	else
	{
		SetButtonValue(1,3,0);      //模式1
	  pram_status.Unit_Change_last_status=0;
//		Usart_SendString(USART2,"Unit:mode1");
	}
	AT24CXX_WriteOneByte(3,pram_status.Unit_Change_last_status);
//  FLASH_WriteByte(START_ADDR4,(uint16)pram_status.Unit_Change_last_status);

}

//恢复上一次设置状态
void Return_last_status(void)
{
  Speaker_Key_Process(pram_status.Voice_last_status);	        //设置页面语音提示按钮状态处理程序
	Safe_Z_process(pram_status.Safe_Z_last_status);             //设置页面安全Z按钮触发后处理程序
	Auto_Knife_process(pram_status.Auto_Knife_last_status);     //设置页面自动对刀按钮触发后处理程序
	Unit_Change_process(pram_status.Unit_Change_last_status);   //设置页面单位切换按钮触发后处理程序
}

//保存当前设置
void Save_Set(void)
{
  Speaker_Key_Process(pram_status.voice_button_status);     //语音提示按钮处理函数
	Safe_Z_process(pram_status.Safe_Z_button_satus);           //安全Z触发处理函数
	Auto_Knife_process(pram_status.Auto_Knife_button_status);  //自动对刀按钮触发后处理程序
	Unit_Change_process(pram_status.Unit_Change_button_status); //单位切换按钮触发后处理程序

