pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
}

//获取设置页面几个参数值（断电保存在flash）
void Get_Setting_page_pram(void)
{
	pram_status.Voice_last_status=AT24CXX_ReadOneByte(0);
	pram_status.voice_button_status=pram_status.Voice_last_status;            //设置语音提醒模式
	
	pram_status.Safe_Z_last_status=AT24CXX_ReadOneByte(1);
	pram_status.Safe_Z_button_satus=pram_status.Safe_Z_last_status;           //设置安全Z模式
	
	pram_status.Auto_Knife_last_status=AT24CXX_ReadOneByte(2);
	pram_status.Auto_Knife_button_status=pram_status.Auto_Knife_last_status;  //设置自动对刀模式
	
	pram_status.Unit_Change_last_status=AT24CXX_ReadOneByte(3);
	pram_status.Unit_Change_button_status=pram_status.Unit_Change_last_status; //设置单位模式
}
//坐标切换控制
void Coordinate_Change_Process(void)
{
	Coordinate_Change_Counter++;
	switch(Coordinate_Change_Counter)
	{
		case 1:
		{
			SetTextValue(0,27,"G55");        //设置文本值
			SetTextValue(3,30,"G55");       
			break;  
		}
		case 2:
		{
			SetTextValue(0,27,"G56");
			SetTextValue(3,30,"G56");
			break;
		}
		case 3:
		{
			SetTextValue(0,27,"G57");
			SetTextValue(3,30,"G57");
			break;
		}
		case 4:
		{
			SetTextValue(0,27,"G58");
			SetTextValue(3,30,"G58");
			break;
		}
		case 5:
		{
			SetTextValue(0,27,"G59");
			SetTextValue(3,30,"G59");
			break;
		}
		case 6:
		{
			SetTextValue(0,27,"G54");
			SetTextValue(3,30,"G54");
			Coordinate_Change_Counter=0;
			break;
		}	
	}
}
//控制面板倍率控制
void Multiple_Change_Process(void)
{
	Multiple_Change_Counter++;	
	switch(Multiple_Change_Counter)
	{
		case 1:
		{
			SetTextValue(0,29,"X10");    //设置文本值
			SetTextValue(3,32,"X10");
			Multiple_num=10;
			break;  
		}
		case 2:
		{
			SetTextValue(0,29,"X20");                                                                                                                                 
			SetTextValue(3,32,"X20");
			Multiple_num=20;
			break;
		}
		case 3:
		{
			SetTextValue(0,29,"X1");
			SetTextValue(3,32,"X1");
			Multiple_num=1;
			break;
		}
		case 4:
		{
			SetTextValue(0,29,"X2");
			SetTextValue(3,32,"X2");
			Multiple_num=2;
			break;
		}
		case 5:
		{
			SetTextValue(0,29,"X5");
			SetTextValue(3,32,"X5");
			Multiple_num=5;
			Multiple_Change_Counter=0;
			break;
		}	
    default:break;		
	}	
  
}

// 在加工页面和控制面板页面显示所有轴坐标
void TFT_Show_coordanate_value(void)
{
		
	Show_X_Coordinata();
	Show_Y_Coordinata();
	Show_Z_Coordinata();
	Show_A_Coordinata();
	Show_B_Coordinata();
	
	Show_X_Machine_Coordinata();
	Show_Y_Machine_Coordinata();
  Show_Z_Machine_Coordinata();
	Show_A_Machine_Coordinata();
  Show_B_Machine_Coordinata();
}

//显示回工件零页面所有轴坐标值
void Show_coordinate_on_return_workpiece_zero_page(void)
{
	char buf[20];
  sprintf((char *)buf,"%09.2f",control_panel_pram.X_value);
	SetTextValue(3,9,(uchar *)buf);	          //在手轮上显示X轴工件坐标
	
	sprintf((char *)buf,"%09.2f",control_panel_pram.Y_value);
	SetTextValue(3,10,(uchar *)buf);	        //在手轮上显示Y轴工件坐标     	
	
	sprintf((char *)buf,"%09.2f",control_panel_pram.Z_value);
	SetTextValue(3,11,(uchar *)buf);	       //在手轮上显示Z轴工件坐标
	
	
	sprintf((char *)buf,"%09.2f",control_panel_pram.A_value);
	SetTextValue(3,12,(uchar *)buf);	       //在手轮上显示A轴工件坐标
		
	
	sprintf((char *)buf,"%09.2f",control_panel_pram.B_value);
	SetTextValue(3,13,(uchar *)buf);	        //在手轮上显示B轴工件坐标
}

//显示X轴机械坐标
void Show_X_Machine_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.X_last_Mac_value!=control_panel_pram.X_Mac_value)
	 {
			sprintf((char *)buf1,"%09.2f",control_panel_pram.X_Mac_value); 
			SetTextValue(3,38,(uchar *)buf1);	                               
			SetTextValue(0,34,(uchar *)buf1);
			control_panel_pram.X_last_Mac_value=control_panel_pram.X_Mac_value;
	 }
}

//显示Y轴机械坐标
void Show_Y_Machine_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.Y_last_Mac_value!=control_panel_pram.Y_Mac_value)
	 {
			sprintf((char *)buf1,"%09.2f",control_panel_pram.Y_Mac_value);
			SetTextValue(3,39,(uchar *)buf1);                                
			SetTextValue(0,35,(uchar *)buf1);
			control_panel_pram.Y_last_Mac_value=control_panel_pram.Y_Mac_value;
	 }
}

//显示Z轴机械坐标
void Show_Z_Machine_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.Z_last_Mac_value!=control_panel_pram.Z_Mac_value)
	 {
			sprintf((char *)buf1,"%09.2f",control_panel_pram.Z_Mac_value);
			SetTextValue(3,40,(uchar *)buf1);                                
			SetTextValue(0,36,(uchar *)buf1);
			control_panel_pram.Z_last_Mac_value=control_panel_pram.Z_Mac_value;
	 }
}
	
//显示A轴机械坐标
void Show_A_Machine_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.A_last_Mac_value!=control_panel_pram.A_Mac_value)
	 {
			sprintf((char *)buf1,"%09.2f",control_panel_pram.A_Mac_value);
			SetTextValue(3,41,(uchar *)buf1);                                
			SetTextValue(0,37,(uchar *)buf1);
			control_panel_pram.A_last_Mac_value=control_panel_pram.A_Mac_value;
	 }
}

//显示B轴机械坐标
void Show_B_Machine_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.B_last_Mac_value!=control_panel_pram.B_Mac_value)
	 {
			sprintf((char *)buf1,"%09.2f",control_panel_pram.B_Mac_value);
			SetTextValue(3,42,(uchar *)buf1);                               
			SetTextValue(0,38,(uchar *)buf1);
			control_panel_pram.B_last_Mac_value=control_panel_pram.B_Mac_value;
	 }
}

//显示X轴工件坐标
void Show_X_Coordinata(void)
{	
	char buf1[20];
	if(control_panel_pram.X_last_value!=control_panel_pram.X_value)
	{
		sprintf((char *)buf1,"%09.2f",control_panel_pram.X_value);      //显示X轴工件坐标		
		SetTextValue(0,16,(uchar *)buf1);
		SetTextValue(3,17,(uchar *)buf1);
		control_panel_pram.X_last_value=control_panel_pram.X_value;
	}
}


//显示Y轴工件坐标
void Show_Y_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.Y_last_value!=control_panel_pram.Y_value)
	{
		sprintf((char *)buf1,"%09.2f",control_panel_pram.Y_value);       //显示Y轴工件坐标
		SetTextValue(0,17,(uchar *)buf1);
		SetTextValue(3,18,(uchar *)buf1);
		control_panel_pram.Y_last_value=control_panel_pram.Y_value;
	}
}

//显示Z轴工件坐标
void Show_Z_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.Z_last_value!=control_panel_pram.Z_value)
	{
		sprintf((char *)buf1,"%09.2f",control_panel_pram.Z_value);      //显示Z轴工件坐标
		SetTextValue(0,18,(uchar *)buf1);
		SetTextValue(3,19,(uchar *)buf1);
		control_panel_pram.Z_last_value=control_panel_pram.Z_value;
	}
}

