pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/TFT.c
//显示A轴工件坐标
void Show_A_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.A_last_value!=control_panel_pram.A_value)
	{
		sprintf((char *)buf1,"%09.2f",control_panel_pram.A_value);       //显示A轴工件坐标
		SetTextValue(0,19,(uchar *)buf1);
		SetTextValue(3,20,(uchar *)buf1);
		control_panel_pram.A_last_value=control_panel_pram.A_value;		
	}
}

//显示B轴工件坐标
void Show_B_Coordinata(void)
{
	char buf1[20];
	if(control_panel_pram.B_last_value!=control_panel_pram.B_value)
	{
		sprintf((char *)buf1,"%09.2f",control_panel_pram.B_value);        //显示B轴工件坐标
		SetTextValue(0,20,(uchar *)buf1);
		SetTextValue(3,21,(uchar *)buf1);
		control_panel_pram.B_last_value=control_panel_pram.B_value;
	}
}

//显示X轴选中状态
void Show_X_Axis_State(void)
{
  SetButtonValue(0,42,1);           //X轴选中状态
	SetButtonValue(0,43,0);
	SetButtonValue(0,44,0);
	SetButtonValue(0,45,0);
	SetButtonValue(0,46,0);
	
  SetButtonValue(3,22,1);
	SetButtonValue(3,23,0);
	SetButtonValue(3,24,0);
	SetButtonValue(3,25,0);
	SetButtonValue(3,26,0);
}

//显示Y轴选中状态
void Show_Y_Axis_State(void)
{
  SetButtonValue(0,42,0);           //Y轴选中状态
	SetButtonValue(0,43,1);
	SetButtonValue(0,44,0);
	SetButtonValue(0,45,0);
	SetButtonValue(0,46,0);
	
  SetButtonValue(3,22,0);
	SetButtonValue(3,23,1);
	SetButtonValue(3,24,0);
	SetButtonValue(3,25,0);
	SetButtonValue(3,26,0);
}

//显示Z轴选中状态
void Show_Z_Axis_State(void)
{
  SetButtonValue(0,42,0);           //Z轴选中状态
	SetButtonValue(0,43,0);
	SetButtonValue(0,44,1);
	SetButtonValue(0,45,0);
	SetButtonValue(0,46,0);
	
  SetButtonValue(3,22,0);
	SetButtonValue(3,23,0);
	SetButtonValue(3,24,1);
	SetButtonValue(3,25,0);
	SetButtonValue(3,26,0);
}

//显示A轴选中状态
void Show_A_Axis_State(void)
{
  SetButtonValue(0,42,0);           //A轴选中状态
	SetButtonValue(0,43,0);
	SetButtonValue(0,44,0);
	SetButtonValue(0,45,1);
	SetButtonValue(0,46,0);
	
  SetButtonValue(3,22,0);
	SetButtonValue(3,23,0);
	SetButtonValue(3,24,0);
	SetButtonValue(3,25,1);
	SetButtonValue(3,26,0);
}

//显示B轴选中状态
void Show_B_Axis_State(void)
{
  SetButtonValue(0,42,0);           //B轴选中状态
	SetButtonValue(0,43,0);
	SetButtonValue(0,44,0);
	SetButtonValue(0,45,0);
	SetButtonValue(0,46,1);
	
  SetButtonValue(3,22,0);
	SetButtonValue(3,23,0);
	SetButtonValue(3,24,0);
	SetButtonValue(3,25,0);
	SetButtonValue(3,26,1);
}
